/*
배열 나누기
함수 division 특정한 배열을 내가 원하는 원소의 갯수를 길이로 가진 배열들로 분해하려고한다
이후, 해당 배열들을 요소로 갖는 배열을 반환한다
ex) 길이기 80인 배열은 길이가 5로 분해한다면 16개의 배열을 요소로 갖는 배열을 반환한다

1. 요구사항 확인하기
2. 요구사항 바탕으로 인풋 생각하기
3. 인풋 바탕으로 단계별 한글로 함수 설계하기
4. 단계별 구글링 키워드 생각하기

*/

function division() {}

// arr = [1,2,3,4,5]
// division(arr, 2); === [ [1,2], [3,4], [5] ]

/*
1. output 구상
 (1) division 함수 실행 시, 분해된 배열들을 요소로 갖는 배열을 반환

2. input 연상
 (1) 분해할 배열 (길이)
 (2) 분해된 배열이 갖게 되는 요소의 갯수
 (3) 분해된 배열들을 요소로 갖는 새로운 배열 만들기

3. 함수 설계
 (1) 2.(1)&(2)를 인자로 받음 => division(분해할 배열, 분해된 배열이 갖게 되는 요소의 갯수)
 (2) 분해할 배열, 분해된 배열이 갖는 요소의 갯수 각각 변수 선언
    ex) let arr = [] 
 (2) 분해할 배열들의 요소 => 인덱스 번호로 접근

4. 단계별 구글링 키워드 생각하기
 (1) 자바스크립트 division 함수
 (2) 자바스크립트 배열을 n개씩 나누어 자르기




*/
